content/posts/the-start-of-bide.md
+++
title = """
  Embarking on a Journey to Revolutionize Code Editing: The Birth of "BiDE"
  """
author = ["Arjen Wiersma"]
date = 2023-09-04T20:44:00+02:00
draft = false
+++

As the warm haze of summer gives way to the crisp air of autumn, the season marks a pivotal moment in my academic journey: the commencement of my Master's thesis project. Having successfully had my research proposal accepted earlier this year, I now face the last leg of this marathon—bringing my theoretical framework to life.


## The Powerhouse Partnership: Open Universiteit and CWI {#the-powerhouse-partnership-open-universiteit-and-cwi}

While undertaking a Master's thesis is a significant endeavor on its own, I always have to make it more complex. My research will be a collaborative effort between two prominent institutions: the Open Universiteit and the Centrum Wiskunde &amp; Informatica (CWI).

The CWI is not just another research facility; it is a cornerstone in the Dutch digital landscape. It has been the crucible for pioneering advancements that have indelibly shaped our digital world. To name a few highlights, CWI is the hallowed ground where the first-ever internet connection was established, where the Python programming language was conceived, and where countless other groundbreaking technological milestones have taken root. In my venture, I will be joining forces with the SWAT group, a team that specializes in Software Analysis and Transformation.


## Introducing "BiDE": Bridging the Gap Between Code and Visualization {#introducing-bide-bridging-the-gap-between-code-and-visualization}

At the crux of my research is the creation of a novel visual language designed to facilitate intuitive code editing. Dubbed "BiDE", short for Bidirectional Diagrammatic Editors, this language aims to serve as a transformative tool in how we understand and manipulate code.

Imagine a scenario where you're faced with an enigmatic, complex piece of code—a labyrinth of loops, conditionals, and functions. Traditionally, you would have to painstakingly dissect each line, trying to visualize the underlying architecture mentally. With BiDE, that approach is poised to become a relic of the past. Instead, a streamlined diagrammatic representation of the code will pop up, offering you a high-level overview.

What sets BiDE apart is its bidirectional functionality. Not only can you comprehend the structure of the code through its visual depiction, but you can also make edits either in the diagrammatic interface or the source code. The brilliance lies in their synchrony; changes in one environment are automatically reflected in the other, keeping both up-to-date in real-time.


## A Journey of Discovery, Planning, and Adaptation {#a-journey-of-discovery-planning-and-adaptation}

As I've begun work on my thesis, I've quickly noticed that the process is surprisingly open-ended. Aside from regular meetings with my supervisor, there's not much of a predefined structure. This makes the ability to plan and organize my work even more crucial than before. Without a strong framework, it's easy to get lost in the complexity of the project. So, while the flexibility offers a lot of freedom, it also comes with the responsibility to be my own taskmaster, making sure each piece of the puzzle fits just right.


## Staying Connected {#staying-connected}

As I move forward, I will update you on the developments, challenges, and breakthroughs of this endeavor.
